In [56]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib_inline
import seaborn as sns
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

In [57]:
test = pd.read_csv('drive/MyDrive/Machine_learning/Titanic/test.csv', index_col='PassengerId')

In [3]:
test.head()

             Pclass  ... Embarked
PassengerId          ...
892               3  ...        Q
893               3  ...        S
894               2  ...        Q
895               3  ...        S
896               3  ...        S

[5 rows x 10 columns]

In [4]:
test.loc[test['Sex']=='female']     #playing with the data

             Pclass  ... Embarked
PassengerId          ...
893               3  ...        S
896               3  ...        S
898               3  ...        Q
900               3  ...        C
904               1  ...        S
...             ...  ...      ...
1301              3  ...        S
1302              3  ...        Q
1303              1  ...        Q
1304              3  ...        S
1306              1  ...        C

[152 rows x 10 columns]

In [5]:
train = pd.read_csv('drive/MyDrive/Machine_learning/Titanic/train.csv',index_col='PassengerId')

In [6]:
train.head()

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S

[5 rows x 11 columns]

In [66]:
df = train.drop(columns=['Ticket','Cabin','Name'], axis=1) #these columns wont have a effect on the morbidity rate, so dropping them
df.head()

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                   0       3    male  22.0      1      0   7.2500        S
2                   1       1  female  38.0      1      0  71.2833        C
3                   1       3  female  26.0      0      0   7.9250        S
4                   1       1  female  35.0      1      0  53.1000        S
5                   0       3    male  35.0      0      0   8.0500        S

In [67]:
X,Y = data_cleaner(df)

In [65]:
#getting our data in numerical form for regression to work and filling nan values with mean and mode of the data
def data_cleaner(dft):                          
  dft['Sex'].replace(to_replace= {'male':0,'female':1},inplace = True)
  dft['Embarked'].replace(to_replace= {'S':0,'C':1,'Q':2},inplace = True)
  dft['Age'].fillna(dft['Age'].mean(), inplace=True)
  dft['Embarked'].fillna(dft['Embarked'].mode()[0],inplace = True)
  dft.reset_index(drop=True, inplace= True)
  Y = dft['Survived']
  X = dft.drop(columns='Survived',inplace=False)
  df2 = X['Age']/80
  X['Age'] = df2
  df2 = X['Fare']/(X['Fare'].max())
  X['Fare'] = df2
  return X,Y

In [68]:
X.head()

   Pclass  Sex     Age  SibSp  Parch      Fare  Embarked
0       3    0  0.2750      1      0  0.014151       0.0
1       1    1  0.4750      1      0  0.139136       1.0
2       3    1  0.3250      0      0  0.015469       0.0
3       1    1  0.4375      1      0  0.103644       0.0
4       3    0  0.4375      0      0  0.015713       0.0

In [69]:
X['Fare'].max()

1.0

In [91]:
X_train, X_test, Y_train, Y_test = train_test_split(X,Y, test_size=0.25, random_state =4)

**Model fitting and training set accuracy**

In [92]:
model = LogisticRegression()
model.fit(X_train,Y_train)
X_train_pred = model.predict(X_train)
training_accu = accuracy_score(Y_train, X_train_pred)
training_accu

0.7919161676646707

**Testing set accuracy**

In [93]:
X_test_pred = model.predict(X_test)
test_accu = accuracy_score(Y_test,X_test_pred)
test_accu

0.8116591928251121